# Pandas

In [1]:
import pandas as pd

In [7]:
numbers = pd.Series([1,2,3,4,5], name="number")
numbers

0    1
1    2
2    3
3    4
4    5
Name: number, dtype: int64

In [6]:
numbers[0]

1

In [8]:
numbers = pd.Series([1,2,3,4,5], index=["one", "two", "three", "four", "five"], name="number")
numbers

one      1
two      2
three    3
four     4
five     5
Name: number, dtype: int64

In [12]:
numbers["two"]

2

In [19]:
numbers.iloc[1]

2

In [13]:
numbers.loc["two"]

2

In [24]:
numbers = pd.Series([10,20,30,40,50], index=[1,2,3,4,5], name="number")
numbers

1    10
2    20
3    30
4    40
5    50
Name: number, dtype: int64

In [25]:
numbers[1]

10

In [26]:
numbers.iloc[1]

20

In [27]:
numbers.loc[1]

10

In [29]:
numbers.dtype

dtype('int64')

In [30]:
numbers.name

'number'

In [31]:
numbers = pd.Series([10,20,30,40,50], index=[1,2,3,4,5], name="number", dtype=str)
numbers

1    10
2    20
3    30
4    40
5    50
Name: number, dtype: object

## List vs Pandas.Series

In [40]:
nums = pd.Series([1,2,4,5])
nums2 = pd.Series([6,7,8,9,0])
new_nums = pd.concat([nums, nums2])
new_nums

0    1
1    2
2    4
3    5
0    6
1    7
2    8
3    9
4    0
dtype: int64

In [41]:
new_nums[0]

0    1
0    6
dtype: int64

In [43]:
new_nums.iloc[0]

1

## Dataframe

In [7]:
df = pd.read_csv(r"D:\sunrise-notebook\data-science-fundamental\code-sample\Python-for-data-science\football.csv")
df

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,13,81.3%,41,62,2,9,0,9,9,16
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,9,60.1%,53,73,8,7,0,11,11,19
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,10,66.7%,25,38,8,4,0,7,7,15
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,22,88.1%,43,45,6,5,0,11,11,16
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,6,54.6%,36,51,5,6,0,11,11,19
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,13,65.1%,67,48,12,9,1,12,12,20
7,Italy,6,34,45,43.0%,7.5%,110,2,0,0,...,20,74.1%,101,89,16,16,0,18,18,19
8,Netherlands,2,12,36,25.0%,4.1%,60,2,0,0,...,12,70.6%,35,30,3,5,0,7,7,15
9,Poland,2,15,23,39.4%,5.2%,48,0,0,0,...,6,66.7%,48,56,3,7,1,7,7,17
10,Portugal,6,22,42,34.3%,9.3%,82,6,0,0,...,10,71.5%,73,90,10,12,0,14,14,16
11,Republic of Ireland,1,7,12,36.8%,5.2%,28,0,0,0,...,17,65.4%,43,51,11,6,1,10,10,17
12,Russia,5,9,31,22.5%,12.5%,59,2,0,0,...,10,77.0%,34,43,4,6,0,7,7,16
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,15,93.8%,102,83,19,11,0,17,17,18
14,Sweden,5,17,19,47.2%,13.8%,39,3,0,0,...,8,61.6%,35,51,7,7,0,9,9,18
15,Ukraine,2,7,26,21.2%,6.0%,38,0,0,0,...,13,76.5%,48,31,4,5,0,9,9,18

In [45]:
df.columns

Index(['Team', 'Goals', 'Shots on target', 'Shots off target',
       'Shooting Accuracy', '% Goals-to-shots', 'Total shots (inc. Blocked)',
       'Hit Woodwork', 'Penalty goals', 'Penalties not scored', 'Headed goals',
       'Passes', 'Passes completed', 'Passing Accuracy', 'Touches', 'Crosses',
       'Dribbles', 'Corners Taken', 'Tackles', 'Clearances', 'Interceptions',
       'Clearances off line', 'Clean Sheets', 'Blocks', 'Goals conceded',
       'Saves made', 'Saves-to-shots ratio', 'Fouls Won', 'Fouls Conceded',
       'Offsides', 'Yellow Cards', 'Red Cards', 'Subs on', 'Subs off',
       'Players Used'],
      dtype='object')

In [47]:
df.dtypes

Team                           object
Goals                           int64
Shots on target                 int64
Shots off target                int64
Shooting Accuracy              object
% Goals-to-shots               object
Total shots (inc. Blocked)      int64
Hit Woodwork                    int64
Penalty goals                   int64
Penalties not scored            int64
Headed goals                    int64
Passes                          int64
Passes completed                int64
Passing Accuracy               object
Touches                         int64
Crosses                         int64
Dribbles                        int64
Corners Taken                   int64
Tackles                         int64
Clearances                      int64
Interceptions                   int64
Clearances off line           float64
Clean Sheets                    int64
Blocks                          int64
Goals conceded                  int64
Saves made                      int64
Saves-to-shots ratio           object
Fouls Won                       int64
Fouls Conceded                  int64
Offsides                        int64
Yellow Cards                    int64
Red Cards                       int64
Subs on                         int64
Subs off                        int64
Players Used                    int64
dtype: object

In [71]:
ndf = df[["Team","Goals", "Penalty goals", "Players Used"]]
ndf

                   Team  Goals  Penalty goals  Players Used
0               Croatia      4              0            16
1        Czech Republic      4              0            19
2               Denmark      4              0            15
3               England      5              0            16
4                France      3              0            19
5               Germany     10              1            17
6                Greece      5              1            20
7                 Italy      6              0            19
8           Netherlands      2              0            15
9                Poland      2              0            17
10             Portugal      6              0            16
11  Republic of Ireland      1              0            17
12               Russia      5              0            16
13                Spain     12              1            18
14               Sweden      5              0            18
15              Ukraine      2              0            18

In [72]:
ndf.Team

0                 Croatia
1          Czech Republic
2                 Denmark
3                 England
4                  France
5                 Germany
6                  Greece
7                   Italy
8             Netherlands
9                  Poland
10               Portugal
11    Republic of Ireland
12                 Russia
13                  Spain
14                 Sweden
15                Ukraine
Name: Team, dtype: object

In [78]:
ndf.head(2)

             Team  Goals  Penalty goals  Players Used
0         Croatia      4              0            16
1  Czech Republic      4              0            19

In [88]:
ndf["Team"][0]

'Croatia'

In [86]:
ndf.iloc[:, :2]

                   Team  Goals
0               Croatia      4
1        Czech Republic      4
2               Denmark      4
3               England      5
4                France      3
5               Germany     10
6                Greece      5
7                 Italy      6
8           Netherlands      2
9                Poland      2
10             Portugal      6
11  Republic of Ireland      1
12               Russia      5
13                Spain     12
14               Sweden      5
15              Ukraine      2

## Create / update new columns

In [43]:
np.arange(11, 31, 4)

array([11, 15, 19, 23, 27])

In [174]:
import numpy as np

lst = np.arange(11, 31, 1).reshape(5,4)
data = pd.DataFrame(lst, columns=["c1", "c2", "c3", "c4"])
data

   c1  c2  c3  c4
0  11  12  13  14
1  15  16  17  18
2  19  20  21  22
3  23  24  25  26
4  27  28  29  30

In [175]:
data.shape[0]

5

In [176]:
data.shape[1]

4

In [177]:
row, col = data.shape
row, col

(5, 4)

In [178]:
data["row_number"] = ["r1", "r2", "r3", "r4", "r5"]
data

   c1  c2  c3  c4 row_number
0  11  12  13  14         r1
1  15  16  17  18         r2
2  19  20  21  22         r3
3  23  24  25  26         r4
4  27  28  29  30         r5

In [179]:
data["total"] = data.c1 + data.c2 + data.c3 + data["c4"]

In [180]:
data

   c1  c2  c3  c4 row_number  total
0  11  12  13  14         r1     50
1  15  16  17  18         r2     66
2  19  20  21  22         r3     82
3  23  24  25  26         r4     98
4  27  28  29  30         r5    114

In [183]:
data["total"] = data.c1 + data.c2 
data

            c1  c2  c3  c4 row_number  total
row_number
r1          11  12  13  14         r1     23
r2          15  16  17  18         r2     31
r3          19  20  21  22         r3     39
r4          23  24  25  26         r4     47
r5          27  28  29  30         r5     55

In [184]:
data.index = data["row_number"]

In [185]:
data.loc["r1"]

c1            11
c2            12
c3            13
c4            14
row_number    r1
total         23
Name: r1, dtype: object

## Aggregation

In [186]:
import numpy as np

lst = np.arange(11, 31, 1).reshape(5,4)
data = pd.DataFrame(lst, columns=["c1", "c2", "c3", "c4"])
data

   c1  c2  c3  c4
0  11  12  13  14
1  15  16  17  18
2  19  20  21  22
3  23  24  25  26
4  27  28  29  30

In [187]:
data.sum(axis=1)

0     50
1     66
2     82
3     98
4    114
dtype: int64

In [188]:
data["sum"] = data.sum(axis=1)
data["total"] = data.c1 + data.c2 + data.c3 + data["c4"]
data

   c1  c2  c3  c4  sum  total
0  11  12  13  14   50     50
1  15  16  17  18   66     66
2  19  20  21  22   82     82
3  23  24  25  26   98     98
4  27  28  29  30  114    114

In [189]:
data["avg"] = data.mean(axis=1)
data

   c1  c2  c3  c4  sum  total   avg
0  11  12  13  14   50     50  25.0
1  15  16  17  18   66     66  33.0
2  19  20  21  22   82     82  41.0
3  23  24  25  26   98     98  49.0
4  27  28  29  30  114    114  57.0

In [191]:
pd.__version__

'1.5.3'

In [192]:
data

   c1  c2  c3  c4  sum  total   avg
0  11  12  13  14   50     50  25.0
1  15  16  17  18   66     66  33.0
2  19  20  21  22   82     82  41.0
3  23  24  25  26   98     98  49.0
4  27  28  29  30  114    114  57.0

In [197]:
new_df = pd.DataFrame(data.sum()).T
new_df.index = ['total']
new_df

         c1     c2     c3     c4    sum  total    avg
total  95.0  100.0  105.0  110.0  410.0  410.0  205.0

In [198]:
pd.concat([data, new_df])

         c1     c2     c3     c4    sum  total    avg
0      11.0   12.0   13.0   14.0   50.0   50.0   25.0
1      15.0   16.0   17.0   18.0   66.0   66.0   33.0
2      19.0   20.0   21.0   22.0   82.0   82.0   41.0
3      23.0   24.0   25.0   26.0   98.0   98.0   49.0
4      27.0   28.0   29.0   30.0  114.0  114.0   57.0
total  95.0  100.0  105.0  110.0  410.0  410.0  205.0

In [190]:
data.append(pd.Series(data.sum(), name="total"))

C:\Users\soven\AppData\Local\Temp\ipykernel_13488\913326530.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data.append(pd.Series(data.sum(), name="total"))

         c1     c2     c3     c4    sum  total    avg
0      11.0   12.0   13.0   14.0   50.0   50.0   25.0
1      15.0   16.0   17.0   18.0   66.0   66.0   33.0
2      19.0   20.0   21.0   22.0   82.0   82.0   41.0
3      23.0   24.0   25.0   26.0   98.0   98.0   49.0
4      27.0   28.0   29.0   30.0  114.0  114.0   57.0
total  95.0  100.0  105.0  110.0  410.0  410.0  205.0

In [133]:
data

   c1  c2  c3  c4  sum  total   avg
0  11  12  13  14   50     50  25.0
1  15  16  17  18   66     66  33.0
2  19  20  21  22   82     82  41.0
3  23  24  25  26   98     98  49.0
4  27  28  29  30  114    114  57.0

In [134]:
data = data.append(pd.Series(data.sum(), name="total"))
data

C:\Users\soven\AppData\Local\Temp\ipykernel_13488\1102200420.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data = data.append(pd.Series(data.sum(), name="total"))

         c1     c2     c3     c4    sum  total    avg
0      11.0   12.0   13.0   14.0   50.0   50.0   25.0
1      15.0   16.0   17.0   18.0   66.0   66.0   33.0
2      19.0   20.0   21.0   22.0   82.0   82.0   41.0
3      23.0   24.0   25.0   26.0   98.0   98.0   49.0
4      27.0   28.0   29.0   30.0  114.0  114.0   57.0
total  95.0  100.0  105.0  110.0  410.0  410.0  205.0

# Fill missing value

In [139]:
lst = [
    [1,2, None],
    [3,None, 5],
    [6,7,8],
]
data = pd.DataFrame(lst, columns=["c1", "c2", "c3"])
data

   c1   c2   c3
0   1  2.0  NaN
1   3  NaN  5.0
2   6  7.0  8.0

In [140]:
data.dropna(axis=0)

   c1   c2   c3
2   6  7.0  8.0

In [145]:
book = pd.read_excel("Book1.xlsx")
book

   c1   c2   c3  total
0   1    b  NaN    NaN
1   1    A  3.0    NaN
2   1  NaN  3.0    4.0

In [156]:
book.isna().sum()

c1       0
c2       1
c3       1
total    2
dtype: int64

In [147]:
book.dtypes

c1         int64
c2        object
c3       float64
total    float64
dtype: object

In [148]:
data.dropna(axis=1)

   c1
0   1
1   3
2   6

In [150]:
data.isna()

      c1     c2     c3
0  False  False   True
1  False   True  False
2  False  False  False

In [158]:
data

   c1   c2   c3
0   1  2.0  NaN
1   3  NaN  5.0
2   6  7.0  8.0

In [162]:
data.c2.fillna(3, inplace=True)
data

   c1   c2   c3
0   1  2.0  NaN
1   3  3.0  5.0
2   6  7.0  8.0

In [166]:
lst = [
    [1,2, None],
    [3,None, 5],
    [6,7,8],
]
data = pd.DataFrame(lst, columns=["c1", "c2", "c3"])
data

   c1   c2   c3
0   1  2.0  NaN
1   3  NaN  5.0
2   6  7.0  8.0

In [169]:
data[pd.isna(data["c2"])]

   c1  c2   c3
1   3 NaN  5.0

In [170]:
data.c2.fillna(3, inplace=True)
data

   c1   c2   c3
0   1  2.0  NaN
1   3  3.0  5.0
2   6  7.0  8.0

In [172]:
average = data.c3.mean()
data.c3.fillna(average, inplace=True)
data

   c1   c2   c3
0   1  2.0  6.5
1   3  3.0  5.0
2   6  7.0  8.0

# Group by

In [3]:
ecom = pd.read_csv("./excercise/02-ecommerce/Ecommerce.csv")
ecom.head(5).T

,0,1,2,3,4
Address,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...","9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",Unit 0065 Box 5052\nDPO AP 27450,"7780 Julia Fords\nNew Stacy, WA 45798","23012 Munoz Drive Suite 337\nNew Cynthia, TX 5..."
Lot,46 in,28 rn,94 vE,36 vm,20 IE
AM or PM,PM,PM,PM,PM,AM
Browser Info,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...
Company,Martinez-Herman,"Fletcher, Richards and Whitaker","Simpson, Williams and Pham","Williams, Marshall and Buchanan","Brown, Watson and Andrews"
Credit Card,6011929061123406,3337758169645356,675957666125,6011578504430710,6011456623207998
CC Exp Date,02/20,11/18,08/19,02/24,10/25
CC Security Code,900,561,699,384,678
CC Provider,JCB 16 digit,Mastercard,JCB 16 digit,Discover,Diners Club / Carte Blanche
Email,pdunlap@yahoo.com,anthony41@reed.com,amymiller@morales-harrison.com,brent16@olson-robinson.info,christopherwright@gmail.com
Job,"Scientist, product/process development",Drilling engineer,Customer service manager,Drilling engineer,Fine artist
IP Address,149.146.147.205,15.160.41.51,132.207.160.22,30.250.74.19,24.140.33.94
Language,el,fr,de,es,es
Purchase Price,98.14,70.73,0.95,78.04,77.82

# Which Job make more purchases in ecommerce datasets?

In [23]:
ecom.groupby("Job")["Purchase Price"].count().sort_values(ascending=False)

Job
Interior and spatial designer        31
Lawyer                               30
Social researcher                    28
Designer, jewellery                  27
Research officer, political party    27
                                     ..
Music therapist                       7
Editor, film/video                    6
Actuary                               6
Investment analyst                    5
Information systems manager           5
Name: Purchase Price, Length: 623, dtype: int64

In [10]:
ecom.groupby("Job")["Purchase Price"].count().sort_values(ascending=False)

Job
Interior and spatial designer        31
Lawyer                               30
Social researcher                    28
Designer, jewellery                  27
Research officer, political party    27
                                     ..
Music therapist                       7
Editor, film/video                    6
Actuary                               6
Investment analyst                    5
Information systems manager           5
Name: Purchase Price, Length: 623, dtype: int64

In [11]:
ecom.groupby("Job")["Purchase Price"].sum().sort_values(ascending=False)

Job
Dietitian                      1605.30
Lawyer                         1603.85
Purchasing manager             1577.97
Therapist, art                 1526.31
Clinical cytogeneticist        1495.92
                                ...
Music therapist                 327.50
Actuary                         262.72
Information systems manager     241.42
Marketing executive             234.08
Art gallery manager             219.05
Name: Purchase Price, Length: 623, dtype: float64

In [29]:
ecom.groupby(["Job", "AM or PM"]).sum()["Purchase Price"]

C:\Users\soven\AppData\Local\Temp\ipykernel_8044\939015046.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  ecom.groupby(["Job", "AM or PM"]).sum()["Purchase Price"]

Job                    AM or PM
Academic librarian     AM          278.24
                       PM          249.23
Accommodation manager  AM          348.70
                       PM          280.95
Accountant, chartered  AM          631.45
                                    ...
Wellsite geologist     PM          621.49
Writer                 AM          133.84
                       PM          314.79
Youth worker           AM          264.13
                       PM          465.11
Name: Purchase Price, Length: 1246, dtype: float64

In [31]:
ecom.groupby(["Job", "AM or PM"]).describe()["Purchase Price"]

                                count       mean        std    min      25%  \
Job                   AM or PM
Academic librarian    AM          7.0  39.748571  26.284071   0.76  18.9650
                      PM          4.0  62.307500  26.942403  29.55  51.3825
Accommodation manager AM          7.0  49.814286  19.778546  19.95  37.6250
                      PM         10.0  28.095000  16.757590   5.48  14.5925
Accountant, chartered AM         11.0  57.404545  39.378200   0.49  26.8100
...                               ...        ...        ...    ...      ...
Wellsite geologist    PM         12.0  51.790833  25.835590  11.17  37.0175
Writer                AM          4.0  33.460000  32.577572   5.94   9.1800
                      PM          6.0  52.465000  24.949518  21.10  39.5200
Youth worker          AM          8.0  33.016250  26.053465   4.68  19.2450
                      PM         10.0  46.511000  34.881037   5.40  15.7675

                                   50%      75%    max
Job                   AM or PM
Academic librarian    AM        53.010  60.4350  65.67
                      PM        62.265  73.1900  95.15
Accommodation manager AM        57.010  57.8550  80.78
                      PM        29.280  33.2925  57.89
Accountant, chartered AM        55.020  92.9000  98.54
...                                ...      ...    ...
Wellsite geologist    PM        53.490  67.1225  98.42
Writer                AM        25.865  50.1450  76.17
                      PM        47.350  64.1500  92.33
Youth worker          AM        26.605  39.0225  90.47
                      PM        41.970  73.5650  98.62

[1246 rows x 8 columns]

# Combine 2 datasets

## Concate

In [2]:
data = pd.DataFrame({
    "id": [1,2,3],
    "name": ["Joe", "Jonh", "Jame"]
})

data2 = pd.DataFrame({
    "id": [4,5],
    "name": ["Ben", "Bill"],
    "gender": ["M", "F"]
})

In [3]:
data

   id  name
0   1   Joe
1   2  Jonh
2   3  Jame

In [4]:
data2

   id  name gender
0   4   Ben      M
1   5  Bill      F

In [54]:
pd.concat([data, data2])

   id  name gender
0   1   Joe    NaN
1   2  Jonh    NaN
2   3  Jame    NaN
0   4   Ben      M
1   5  Bill      F

In [55]:
pd.concat([data, data2], axis=1)

   id  name   id  name gender
0   1   Joe  4.0   Ben      M
1   2  Jonh  5.0  Bill      F
2   3  Jame  NaN   NaN    NaN

In [5]:
data = pd.DataFrame({
    "id": [1,2,3],
    "name": ["Joe", "Jonh", "Jame"]
},
index = [0,1,2]
)

data2 = pd.DataFrame({
    "id": [4,5],
    "name": ["Ben", "Bill"],
    "gender": ["M", "F"]
},
index = [2,3]
)

In [6]:
data

   id  name
0   1   Joe
1   2  Jonh
2   3  Jame

In [7]:
data2

   id  name gender
2   4   Ben      M
3   5  Bill      F

In [8]:

pd.concat([data, data2], axis=1)

    id  name   id  name gender
0  1.0   Joe  NaN   NaN    NaN
1  2.0  Jonh  NaN   NaN    NaN
2  3.0  Jame  4.0   Ben      M
3  NaN   NaN  5.0  Bill      F

## Merge

In [69]:
stu = pd.DataFrame({
    "id": [1,2,3],
    "name": ["Joe", "Jonh", "Jame"],
    "class_id": [1,1,2]
},
index = [0,1,2]
)
stu

   id  name  class_id
0   1   Joe         1
1   2  Jonh         1
2   3  Jame         2

In [70]:
classes = pd.DataFrame({
    "class_id": [1,2,3],
    "class_name": ["Data science", "Machine Learning", "AI"]
})
classes

   class_id        class_name
0         1      Data science
1         2  Machine Learning
2         3                AI

In [77]:
new_df = stu.merge(classes, left_on=["class_id"], right_on=["class_id"])
new_df

   id  name  class_id        class_name
0   1   Joe         1      Data science
1   2  Jonh         1      Data science
2   3  Jame         2  Machine Learning

## Join`

In [9]:
data = pd.DataFrame({
    "id": [1,2,3],
    "name": ["Joe", "Jonh", "Jame"]
},
index = [0,1,2]
)

data2 = pd.DataFrame({
    "class_d": [4,5],
    "gender": ["M", "F"]
},
index = [2,3]
)

In [10]:
data

   id  name
0   1   Joe
1   2  Jonh
2   3  Jame

In [11]:
data2

   class_d gender
2        4      M
3        5      F

In [13]:
data.join(data2)

   id  name  class_d gender
0   1   Joe      NaN    NaN
1   2  Jonh      NaN    NaN
2   3  Jame      4.0      M

# Strategy of Join / Merge

In [19]:
data = pd.DataFrame({
    "id": [1,2,3],
    "name": ["Joe", "Jonh", "Jame"]
},
index = [0,1,2]
)

data2 = pd.DataFrame({
    "id2": [3,5],
    "name2": ["Joe", "Bill"],
    "gender": ["M", "F"]
},
index = [2,3]
)

In [20]:
data

   id  name
0   1   Joe
1   2  Jonh
2   3  Jame

In [21]:
data2

   id2 name2 gender
2    3   Joe      M
3    5  Bill      F

In [22]:
data.join(data2)

   id  name  id2 name2 gender
0   1   Joe  NaN   NaN    NaN
1   2  Jonh  NaN   NaN    NaN
2   3  Jame  3.0   Joe      M

In [24]:
data.join(data2, how='left')

   id  name  id2 name2 gender
0   1   Joe  NaN   NaN    NaN
1   2  Jonh  NaN   NaN    NaN
2   3  Jame  3.0   Joe      M

In [23]:
data.join(data2, how='outer')

    id  name  id2 name2 gender
0  1.0   Joe  NaN   NaN    NaN
1  2.0  Jonh  NaN   NaN    NaN
2  3.0  Jame  3.0   Joe      M
3  NaN   NaN  5.0  Bill      F

In [27]:
data.join(data2, how='right')

    id  name  id2 name2 gender
2  3.0  Jame    3   Joe      M
3  NaN   NaN    5  Bill      F

In [29]:
data.join(data2, how='inner')

   id  name  id2 name2 gender
2   3  Jame    3   Joe      M

In [32]:
data.merge(data2, left_on="id", right_on='id2')

   id  name  id2 name2 gender
0   3  Jame    3   Joe      M

In [33]:
data.merge(data2, left_on="id", right_on='id2', how='inner')

   id  name  id2 name2 gender
0   3  Jame    3   Joe      M

In [34]:
data.merge(data2, left_on="id", right_on='id2', how='left')

   id  name  id2 name2 gender
0   1   Joe  NaN   NaN    NaN
1   2  Jonh  NaN   NaN    NaN
2   3  Jame  3.0   Joe      M

In [35]:
data.merge(data2, left_on="id", right_on='id2', how='right')

    id  name  id2 name2 gender
0  3.0  Jame    3   Joe      M
1  NaN   NaN    5  Bill      F

In [36]:
data.merge(data2, left_on="id", right_on='id2', how='outer')

    id  name  id2 name2 gender
0  1.0   Joe  NaN   NaN    NaN
1  2.0  Jonh  NaN   NaN    NaN
2  3.0  Jame  3.0   Joe      M
3  NaN   NaN  5.0  Bill      F